Repository: wjb127/death-clock-flutter-app
Catalog: lib/l10n/app_*.arb
Languages: de, ja, ko

# appTitle
source: ⏰ Death Clock
de: Lebenszeit-Rechner
ja: 寿命計算機
ko: 남은수명계산기

# appSubtitle
source: Life Timer
de: Lebenszeit-Rechner
ja: 寿命計算機
ko: 수명 계산기

source: Settings
de: Einstellungen
ja: 設定
ko: 설정

# selectBirthday
source: Select your birthday
de: Wählen Sie Ihr Geburtsdatum
ja: 誕生日を選択してください
ko: 생일을 선택하세요

source: Cancel
de: Abbrechen
ja: キャンセル
ko: 취소

source: Confirm
de: Bestätigen
ja: 確認
ko: 확인

source: Remaining Life
de: Verbleibende Lebenszeit
ja: 残り寿命
ko: 남은 수명

source: Life Progress
de: Lebensfortschritt
ja: 人生進行率
ko: 인생 진행률

source: years
de: Jahre
ja: 年
ko: 년

source: days
de: Tage
ja: 日
ko: 일

source: hours
de: Stunden
ja: 時間
ko: 시간

source: minutes
de: Minuten
ja: 分
ko: 분

source: seconds
de: Sekunden
ja: 秒
ko: 초

source: Daily Notifications
de: Tägliche Benachrichtigungen
ja: 毎日通知
ko: 하루 3번 알림 (8시, 13시, 18시)

# notificationEnabled
source: Daily notification set for 8 AM! 🔔
de: Tägliche Benachrichtigung um 8 Uhr morgens eingestellt! 🔔
ja: 毎朝8時に通知が設定されました！🔔
ko: 매일 8시, 13시, 18시에 알림이 설정되었습니다! 🔔

# notificationDisabled
source: Notifications disabled.
de: Benachrichtigungen deaktiviert.
ja: 通知が無効になりました。
ko: 알림이 해제되었습니다.

source: Share Life Stats
de: Lebensstatistiken teilen
ja: 寿命をシェア
ko: 수명 공유하기

source: View Other Quote
de: Anderes Zitat anzeigen
ja: 他の名言を見る
ko: 다른 명언 보기

source: Birthday
de: Geburtstag
ja: 誕生日
ko: 생일

# shareMessage
source: ⏰ Death Clock Life Check Result 📅 Birthday: {birthday} ⏳ Remaining Life: {remainingTime} 📊 Life Progress: {progress}% 💭 "{quote}" What's your remaining time? Check with Death Clock app!
de: ⏰ Death Clock Lebenszeit-Check Ergebnis 📅 Geburtstag: {birthday} ⏳ Verbleibende Lebenszeit: {remainingTime} 📊 Lebensfortschritt: {progress}% 💭 "{quote}" Wie viel Zeit bleibt Ihnen? Überprüfen Sie es mit der Death Clock App!
ja: ⏰ Death Clock 寿命チェック結果 📅 誕生日: {birthday} ⏳ 残り寿命: {remainingTime} 📊 人生進行率: {progress}% 💭 "{quote}" あなたの残り時間は？Death Clockアプリで確認してみてください！
ko: ⏰ Death Clock 수명 체크 결과 📅 생일: {birthday} ⏳ 남은 수명: {remainingTime} 📊 인생 진행률: {progress}% 💭 "{quote}" 당신의 남은 시간은? Death Clock 앱으로 확인해보세요!

# quote1
source: Time is life. Don't waste it.
de: Zeit ist Leben. Verschwende sie nicht.
ja: 時間は命である。無駄にするな。
ko: 시간은 생명이다. 낭비하지 마라.

# quote2
source: Every moment is precious. Live this moment.
de: Jeder Moment ist kostbar. Lebe diesen Moment.
ja: すべての瞬間が貴重だ。今この瞬間を生きろ。
ko: 매 순간이 소중하다. 지금 이 순간을 살아라.

# quote3
source: Those who save time gain life.
de: Wer Zeit spart, gewinnt Leben.
ja: 時間を節約する者が人生を得る。
ko: 시간을 아끼는 자가 인생을 얻는다.

# quote4
source: Don't put off until tomorrow what you can do today.
de: Verschiebe nicht auf morgen, was du heute tun kannst.
ja: 今日できることを明日に延ばすな。
ko: 오늘 할 수 있는 일을 내일로 미루지 마라.

# quote5
source: Time doesn't come back. Focus on the present.
de: Zeit kommt nicht zurück. Konzentriere dich auf die Gegenwart.
ja: 時間は戻らない。現在に集中せよ。
ko: 시간은 돌아오지 않는다. 현재에 집중하라.

# notificationMessage1
source: ⏰ Check your remaining life and wake up!
de: ⏰ Überprüfen Sie Ihre verbleibende Lebenszeit und wachen Sie auf!
ja: ⏰ 残り寿命を確認して目を覚ませ！
ko: ⏰ 남은 수명을 확인하고 정신차리세요!

# notificationMessage2
source: 💀 Time doesn't wait. Check now!
de: 💀 Die Zeit wartet nicht. Überprüfen Sie jetzt!
ja: 💀 時間は待ってくれません。今すぐ確認を！
ko: 💀 시간은 기다려주지 않습니다. 지금 확인하세요!

# notificationMessage3
source: ⚡ Every moment is precious. Check your remaining time!
de: ⚡ Jeder Moment ist kostbar. Überprüfen Sie Ihre verbleibende Zeit!
ja: ⚡ すべての瞬間が貴重です。残り時間をチェック！
ko: ⚡ 매 순간이 소중합니다. 남은 시간을 체크하세요!

# notificationMessage4
source: 🔥 Life is short. Make today meaningful!
de: 🔥 Das Leben ist kurz. Machen Sie heute sinnvoll!
ja: 🔥 人生は短い。今日も意味のある一日を！
ko: 🔥 인생은 짧습니다. 오늘도 의미있게 보내세요!

# notificationMessage5
source: 💎 Time is your most precious asset. Check it!
de: 💎 Zeit ist Ihr wertvollstes Gut. Überprüfen Sie es!
ja: 💎 時間は最も貴重な資産です。確認してみて！
ko: 💎 시간은 가장 귀한 자산입니다. 확인해보세요!

# notificationMessage6
source: 🚀 Run towards your goals. Check your remaining time!
de: 🚀 Laufen Sie auf Ihre Ziele zu. Überprüfen Sie Ihre verbleibende Zeit!
ja: 🚀 目標に向かって走れ。残り時間を確認！
ko: 🚀 목표를 향해 달려가세요. 남은 시간을 확인하세요!

# notificationMessage7
source: ⭐ Cherish today too! Check your life timer
de: ⭐ Schätzen Sie auch heute! Gehen Sie zur Lebenszeit-Überprüfung
ja: ⭐ 今日も大切に！寿命チェックしに行こう
ko: ⭐ 오늘 하루도 소중히! 수명 체크하러 가기

# notificationMessage8
source: 🎯 First step of time management: Check remaining life
de: 🎯 Erster Schritt des Zeitmanagements: Verbleibende Lebenszeit überprüfen
ja: 🎯 時間管理の第一歩、残り寿命の確認
ko: 🎯 시간 관리의 첫걸음, 남은 수명 확인하기
